## Bash

Bash - это консоль (СLI) и скриптовой Язык програмирвония

### Управление Терминалом (консоль)

Cдвинуль лог вверх
`Ctrl+L`

Очистить экран
`clear`

Получить историю
```shell
history
```

Перелистывание ранее введенных команд
`Стрелка вверх/стрелка вниз`

Выполнить последнюю команду (из списка history)
```shell
!!
```
Выполнить указанную команду из списка history
```shell
!45
```
где `45` это порядковый номер команды из history

Остановить запущенный в консоле процесс по `Ctrl+С`

### Файловые операции 

Получить структуру каталогов и файлов
```shell
tree
```
получить абсолютный путь к текущему каталогу
```shell
pwd
```
показать содержимое текущего каталога
```shell
ls
```
или подробно 
```shell
ll
```
или
```shell
ls -all
```
или показать содержимое указанной папки
```shell
ls Dir_name
```
где `Dir_name` - это имя нужной папки

Правила именования каталогов и файлов:
1. Только по-английски
1. Без пробелов и спец.символов
1. Если имя файла или каталога состоит из нескольких англ.слов., то имя можно создать так: `firstOfall` или `first_of_all` 
1. В имени файлов лучше всегда указывать расширение `fileName.txt`

Выйти из текущей папки
```shell
cd ..
```
Вернуться в предыдущую папку
```shell
cd -
```
Зайти в указанную папку 
```shell
сd TargetFolder
```

Знаки:
`\` - обратный слэш - признак каталога
`/` - прямой слэш - признак каталога
`|` - вертикальный слэш - признак разделения команд 

Windows:
`\` - корневой каталог 
Unix/Linux/Android/macOS,IOS,BSD:
`/` - корневой каталог

Выйти из текущего каталога на 2 шага вверх:
```shell
cd ../..
```

#### Создание файлов и каталогов

Создание файлов
```shell
touch file_name.txt
```
редактировать текстовый файл
```shell
micro file_name.txt
```
- `micro` - текстовый редактор командной строки
- Cохранить по `Ctrl+S` и выйти из редактора по `Ctrl+Q`

Переименовать файл
```shell
mv old_name new_name
```
копирование файла
```shell
cp name_file.txt NewFolder/
```
перепестить файл
```shell
mv file.txt TargerName
```
Удалить файл
```shell
rm delFile.txt
```
Удалить папку
```shell
rm -rf DelFolder
```
Создать несколько файлов
```shell
touch {1..3}.txt
```
Cоздать несколько каталогов
```shell
mkdir folderName{1..4}
```
Удалить содержимое текущего каталога
```shell
rm -rf *
```
Cоздать структуру проекта:
project/
│
├── src/         
│   ├── index.html         
│   ├── main.js       
│   ├── css/                
│   │   └── style.css
│   └── components/

Создать такую такую структуру одной командой
```shell
mkdir -p project /{css,js/img/ico,fonts,pages}
```

### Linux

Имя компьютера
```shell
hostname
```
Локальный ip
```shell
hostname -i
```
сетевая информация
```shell
ifconfig
```
или
```shell
ip -c r
```
или подробно
```shell
ip -c a
```
Пинг
```shell
ping ya.ru
```
или определенное кол-во раз
```shell
ping -c 4 ya.ru
```
Получить ин-фу по домену
```shell
whois ozon.ru
```
Получить порты
```shell
netstat -an
```
Получить маршруты
```shell
route
```
Выйти из сеанса пользователя
```shell
exit
```
Перезагрузить 
```shell
reboot
```
Выключить
```shell
poweroff
```
Показать текущее время
```shell
date
```
календарь
```shell
cal
```
или
```shell
cal 2027
```
Получить общую ин-фу по системе
```shell
fastfetch
```
Получить подробную ин-фу по системе
```shell
inxi -F
```

